Fix diagram
